[
  {
    "slug": "robert-yorke",
    "name": "Dr. Robert T. Yorke",
    "role": "Founder",
    "quals": "D.Eng. (Hon.), CEng, FIStructE, FICE, FAPETT",
    "image": "/img/leadership/robert-yorke.jpg",
    "bio": "Dr. Robert T. Yorke, Founder of Yorke Structures Ltd, devoted nearly fifty years to advancing structural engineering in the Caribbean. His personal philosophy and vision transformed YSL into the region's premier structural engineering services company. As Founder, he provided guidance that shaped the company's direction, upheld the highest standards, and positioned the business for continued success. Known for his clarity of vision, he maintained that success required seeing goals clearly, making the necessary sacrifices, and never losing focus. His legacy is one of excellence, leadership, and unwavering commitment to the profession. Dr. Yorke's influence remains deeply embedded in the culture and values of the company he built."
  },
  {
    "slug": "jacqueline-yorke-westcott",
    "name": "Jacqueline Yorke Westcott",
    "role": "Executive Chairman, YSL and MIBR",
    "quals": "SHRM-SCP",
    "image": "/img/leadership/jacqueline-westcott.jpg",
    "bio": "Jacqueline Yorke Westcott brings over eighteen years' expertise in organizational development and human resources management. As Executive Chairman of Yorke Structures Ltd and Mount Irvine Bay Hotel Ltd, she oversees governance, strategy, culture, and long-term growth. Her career includes senior roles in corporate training, intercultural consultancy, and executive coaching, with specialisation in recruitment, talent management, and succession planning. A SHRM Senior Certified Professional, Jacqueline holds advanced qualifications in leadership and organizational change. Her diverse skills are reflected in her formal qualifications – a BEng (Hons) Degree in Civil Engineering. She is committed to building people systems that enhance performance, safety, and service excellence. Her leadership approach integrates strategic oversight with a strong focus on staff engagement, ensuring that YSL continues to grow while preserving its reputation for quality and integrity."
  },
  {
    "slug": "simon-westcott",
    "name": "Simon H. Westcott",
    "role": "Managing Director",
    "quals": "BSc (Hons), CEng, MBA, MICE, MAPETT, FIStructE",
    "image": "/img/leadership/simon-westcott.jpg",
    "bio": "Simon Westcott is a Chartered Civil and Structural Engineer with nearly forty years' experience delivering complex projects across the Caribbean, UK, Africa, and Asia. As Managing Director and a member of the Board, he leads YSL's strategic and operational direction, covering project management, contract administration, commercial performance, and business development. He previously served as Contracts Manager at YSL, successfully managing major projects and liaising closely with all stakeholders. His professional affiliations include the Institution of Civil Engineers, the Institution of Structural Engineers, and A.P.E.T.T. Simon is known for disciplined cost control, efficient delivery, and sustaining client value while driving growth in the company's services and market presence."
  },
  {
    "slug": "kenneth-prince",
    "name": "Kenneth Prince",
    "role": "Contracts Administrator",
    "quals": "MCIOB",
    "image": "/img/leadership/kenneth-prince.jpg",
    "bio": "Kenneth Prince has served as Contracts Administrator at Yorke Structures Ltd since 2000, bringing extensive expertise in site-based execution, contractual compliance, quantity surveying, and value management. A UK citizen, he has worked in Trinidad for over fifteen years, delivering on major projects such as Atlantic LNG Trains 2 and 3, M5000 Methanol Plant, UTT campuses, and the Waterfront Project. A Member of the Chartered Institute of Building and Associate of Cost and Production Surveyors, Kenneth's professional knowledge ensures that YSL consistently meets contractual obligations and maintains the highest standards in project delivery. His focus on professionalism, efficiency, and client satisfaction continues to strengthen YSL's position in the regional construction industry."
  },
  {
    "slug": "khadija-bourne-murray",
    "name": "Khadija Bourne Murray",
    "role": "QHSE Manager",
    "quals": "NEBOSH; ISO 14001, 45001, 9001",
    "image": "/img/leadership/khadija-bourne-murray.jpg",
    "bio": "Khadija Bourne Murray is a QHSE Manager specialising in Quality, Health, Safety and Environmental management systems. She is NEBOSH-certified and trained in ISO 14001, 45001, and 9001 management systems. Khadija leads the development and implementation of workplace safety policies, supports training and investigations, and ensures compliance with all HSE regulations. Her career spans HSE research, environmental consultancy, and forestry safety projects, giving her a broad perspective on risk management. Dedicated to fostering a proactive safety culture, she works closely with operational teams to improve safety performance and reduce workplace hazards. Khadija's approach combines technical expertise with a commitment to continuous improvement and employee well-being."
  }
]